연습 예제
1. titanic data를 호출받아 PassengerId에 따라 행 indexing을 하고 생존여부,객실,성별,나이를 열로 가지는 데이터 프레임을 작성하라

2. age의 결측치를 생존여부, 성별에 따라 	grouping 하고 각각의 평균을 결측치에 대입하라

3. 가상의 시나리오에서 1등석에 탑승한 승객은 구명보트 탑승시 우선 탑승권을 갖는다고 한다. 구조우선권을 기록하는 열을 추가하고 각 행에 구조 우선권을 가지면 o, 우선권이 없으면 x를 대입하라

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.set_index("PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df.group=df.groupby('Pclass')

<ipython-input-5-a742f3062a36>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.group=df.groupby('Pclass')

In [6]:
df=df[['Survived','Pclass','Sex','Age']]

In [7]:
df1 = df[(df['Survived']==1)&(df['Sex']=='female')]

In [8]:
mean1=df1['Age'].mean()

In [9]:
mean1

28.84771573604061

In [10]:
df1['Age']=df1['Age'].fillna(mean1)

<ipython-input-10-fc33c985b85b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Age']=df1['Age'].fillna(mean1)

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 233 entries, 1 to 887
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  233 non-null    int64
 1   Pclass    233 non-null    int64
 2   Sex       233 non-null    object
 3   Age       233 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 9.1+ KB

In [12]:
df2 = df[(df['Survived']==0)&(df['Sex']=='female')]

In [13]:
mean2=df2['Age'].mean()

In [14]:
mean2

25.046875

In [15]:
df2['Age']=df2['Age'].fillna(mean2)

<ipython-input-15-6cde3688ea73>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Age']=df2['Age'].fillna(mean2)

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81 entries, 14 to 888
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  81 non-null     int64
 1   Pclass    81 non-null     int64
 2   Sex       81 non-null     object
 3   Age       81 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 3.2+ KB

In [17]:
df3 = df[(df['Survived']==1)&(df['Sex']=='male')]

In [18]:
mean3=df3['Age'].mean()

In [19]:
mean3

27.276021505376345

In [20]:
df3['Age']=df3['Age'].fillna(mean3)

<ipython-input-20-909e84208545>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Age']=df3['Age'].fillna(mean3)

In [21]:
df3['Age']

17     27.276022
21     34.000000
23     28.000000
36     27.276022
55     27.276022
         ...
838    32.000000
839    27.276022
857    51.000000
869     4.000000
889    26.000000
Name: Age, Length: 109, dtype: float64

In [22]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 109 entries, 17 to 889
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  109 non-null    int64
 1   Pclass    109 non-null    int64
 2   Sex       109 non-null    object
 3   Age       109 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 4.3+ KB

In [23]:
df4 = df[(df['Survived']==0)&(df['Sex']=='male')]

In [24]:
mean4=df4['Age'].mean()

In [25]:
df[(df['Survived']==0)&(df['Sex']=='male')]['Age'].fillna(mean4)

0      22.000000
4      35.000000
5      31.618056
6      54.000000
7       2.000000
         ...
881    33.000000
883    28.000000
884    25.000000
886    27.000000
890    32.000000
Name: Age, Length: 468, dtype: float64

In [26]:
mean4

31.618055555555557

In [27]:
df4['Age']=df4['Age'].fillna(mean4)

<ipython-input-27-579020b8d0df>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4['Age']=df4['Age'].fillna(mean4)

In [28]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 468 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  468 non-null    int64
 1   Pclass    468 non-null    int64
 2   Sex       468 non-null    object
 3   Age       468 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 18.3+ KB

In [29]:
df=df1.append(df2)
df=df.append(df3)
df=df.append(df4)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 34.8+ KB

In [145]:
df1=df[df["Pclass"]==1]

In [146]:
df1['우선권']='o'

<ipython-input-146-867e0802d9bc>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['우선권']='o'

In [147]:
df2=df[df["Pclass"]!=1]

In [148]:
df2['우선권']='x'

<ipython-input-148-b9449965b88f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['우선권']='x'

In [149]:
df2

     Survived  Pclass     Sex   Age 우선권
2           1       3  female  26.0   x
8           1       3  female  27.0   x
9           1       2  female  14.0   x
10          1       3  female   4.0   x
15          1       2  female  55.0   x
..        ...     ...     ...   ...  ..
881         0       3    male  33.0   x
883         0       2    male  28.0   x
884         0       3    male  25.0   x
886         0       2    male  27.0   x
890         0       3    male  32.0   x

[675 rows x 5 columns]

In [150]:
df=df1.append(df2)

In [151]:
df

     Survived  Pclass     Sex        Age 우선권
1           1       1  female  38.000000   o
3           1       1  female  35.000000   o
11          1       1  female  58.000000   o
31          1       1  female  28.847716   o
52          1       1  female  49.000000   o
..        ...     ...     ...        ...  ..
881         0       3    male  33.000000   x
883         0       2    male  28.000000   x
884         0       3    male  25.000000   x
886         0       2    male  27.000000   x
890         0       3    male  32.000000   x

[891 rows x 5 columns]

ValueError: Boolean array expected for the condition, not object

In [33]:
df

     Survived  Pclass     Sex   Age
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
8           1       3  female  27.0
9           1       2  female  14.0
..        ...     ...     ...   ...
881         0       3    male  33.0
883         0       2    male  28.0
884         0       3    male  25.0
886         0       2    male  27.0
890         0       3    male  32.0

[891 rows x 4 columns]